addons/binding/org.openhab.binding.ihc.test/src/test/resources/ResourceValueQueryResponse22222.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:getRuntimeValue2 xmlns:ns1="utcs" xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">22222</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string">resource_temperature</ns1:typeString>

<ns1:value xmlns:ns2="utcs.values"  xsi:type="ns2:WSFloatingPointValue">
<ns2:maximumValue xsi:type="xsd:double">1000.0</ns2:maximumValue>

<ns2:minimumValue xsi:type="xsd:double">-1000.0</ns2:minimumValue>

<ns2:floatingPointValue xsi:type="xsd:double">24.399999618530273</ns2:floatingPointValue>
</ns1:value>
</ns1:getRuntimeValue2>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>